20200820171402-side.org
#+title: Indicator Side
#+hugo_base_dir: hugo
#+hugo_section: articles

* Indicator Side

At any given time an [[file:Algorithm Components/Indicator.org][indicator]] has a side that indicates *long, short or
neutral*.

Typically if the last signal was a long [[file:Algorithm Components/Signal.org][signal]] the side of this indicator is
long until the indicator gives a signal in the oposite direction. Same for short
signals.

Some indicators also describe a neutral state.

** Examples

With a Two Lines Cross indicator with an up and a down line, the side is simply
which line has the higher value.
