hugo/content/articles/20200820171402-side.md
+++
title = "Indicator Side"
author = ["Stefan Lendl"]
draft = false
+++

## Indicator Side {#indicator-side}

At any given time an [indicator]({{< relref "Indicator" >}}) has a side that indicates **long, short or
neutral**.

Typically if the last signal was a long [signal]({{< relref "Signal" >}}) the side of this indicator is
long until the indicator gives a signal in the oposite direction. Same for short
signals.

Some indicators also describe a neutral state.


### Examples {#examples}

With a Two Lines Cross indicator with an up and a down line, the side is simply
which line has the higher value.
